// Κατασκευάστε μια λάμδα συνάρτηση που να δέχεται 2 ακέραιες τιμές και να επιστρέφει το άθροισμα όλων των τιμών ανάμεσα στις δύο αυτές τιμές, 
// συμπεριλαμβανομένων και των ίδιων των ακραίων τιμών. 
// Καλέστε τη συνάρτηση και εμφανίστε το αποτέλεσμα για 3 ζεύγη τιμών που θα ορίσετε.

#include <iostream>

using namespace std;

int main()
{
    auto lambda = [](int x, int y) {
        if (x > y)
        {
            swap(x, y);
        }
        int sum = 0;
        for (int i = x; i <= y; i++)
        {
            sum += i;
        }
        return sum;
    };

    cout << lambda(7, 10) << endl;
    cout << lambda(0, 10) << endl;
    cout << lambda(0, 1000) << endl;
}

/*
34
55
500500
*/