// Γράψτε πρόγραμμα που να δημιουργεί έναν πίνακα 5 θέσεων με τις τιμές {2,7,1,3,6}. 
// Να δέχεται από τον χρήστη μια ακέραια τιμή x και να αντιγράφει τον πίνακα x φορές σε έναν δυναμικό πίνακα τον οποίο στην συνέχεια να εμφανίζει στην οθόνη. 
// Να αποδεσμεύει τον πίνακα πριν τον τερματισμό του προγράμματος

#include <iostream>

using namespace std;

int main()
{
    int a[] = {2, 7, 1, 3, 6};
    int x;
    cin >> x;
    int *b = new int[5 * x];
    for (int i = 0; i < x; i++)
    {
        for (int j = 0; j < 5; j++)
        {
            b[i * 5 + j] = a[j];
        }
    }

    for (int i = 0; i < 5 * x; i++)
    {
        cout << b[i] << " ";
    }

    delete[] b;
}

/*
3
2 7 1 3 6 2 7 1 3 6 2 7 1 3 6 
*/